FI/Potilaan perustiedot/Integraatiopalvelu_Potilaanperustiedot_Esimerkkisanoma_UpdatePatientData_Request_2.0.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Tieto.HCW.EIS.PatientDataIntegration.ServiceContracts" xmlns:urn1="urn:Tieto.HCW.EIS.PatientDataIntegration.WCFService" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.PatientDataIntegration.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:UpdatePatientDataRequest>
         <urn1:MessageHeader>
            <tiet:MessageID>123</tiet:MessageID>
            <tiet:TransactionID>44</tiet:TransactionID>
            <tiet:SenderID>Keksi</tiet:SenderID>
            <tiet:SenderApplication>Portal</tiet:SenderApplication>
            <tiet:ReceiverID>Carea</tiet:ReceiverID>
            <tiet:ReceiverApplication>PatientData</tiet:ReceiverApplication>
            <tiet:CharacterSet>abc</tiet:CharacterSet>
            <tiet:DataServiceURL>joku.jossakin.com</tiet:DataServiceURL>
            <tiet:UserLanguageCode>fi-FI</tiet:UserLanguageCode>
            <tiet:VersionNumber>1</tiet:VersionNumber>
         </urn1:MessageHeader>
         <!--Optional:-->
         <urn1:Common>
            <tiet:ContractKey>aaabbbccc</tiet:ContractKey>
            <tiet:UserId>JimiHe</tiet:UserId>
            <tiet:CallingSystem>Keksi</tiet:CallingSystem>
            <tiet:CallingUserId>1234</tiet:CallingUserId>
         </urn1:Common>
        <urn1:PatientUpd>
            <tiet1:PatientId>
               <tiet1:Identifier>120566-A020</tiet1:Identifier>
            </tiet1:PatientId>
            <tiet1:SecurityBan>false</tiet1:SecurityBan>
            <tiet1:FamilyName>Satumaa</tiet1:FamilyName>
            <tiet1:GivenNames>Sanni</tiet1:GivenNames>
            <tiet1:DateOfDeath>1801-01-01T00:00:00</tiet1:DateOfDeath>
            <tiet1:Profession>Luokanopettaja</tiet1:Profession>
            <tiet1:Sex>
               <tiet1:CodeSetName></tiet1:CodeSetName>
               <tiet1:CodeSetId></tiet1:CodeSetId>
               <tiet1:CodeValue>2</tiet1:CodeValue>
               <tiet1:CodeDescription></tiet1:CodeDescription>
            </tiet1:Sex>
            <tiet1:Language>
               <tiet1:CodeSetName></tiet1:CodeSetName>
               <tiet1:CodeSetId></tiet1:CodeSetId>
               <tiet1:CodeValue>fi</tiet1:CodeValue>
               <tiet1:CodeDescription></tiet1:CodeDescription>
            </tiet1:Language>
            <tiet1:Addresses>
               <tiet1:Address>
                  <tiet1:AddressType>OTHER</tiet1:AddressType>
                  <tiet1:StreetAddress>Juoksupolku 88</tiet1:StreetAddress>
                  <tiet1:PostalCode>77570</tiet1:PostalCode>
                  <tiet1:City>Mummola</tiet1:City>
                  <tiet1:Country></tiet1:Country>
                  <tiet1:PeriodStart>0001-01-01T00:00:00</tiet1:PeriodStart>
                  <tiet1:PeriodEnd>0001-01-01T00:00:00</tiet1:PeriodEnd>
               </tiet1:Address>
               <tiet1:Address>
                  <tiet1:AddressType>ADDITIONAL</tiet1:AddressType>
                  <tiet1:StreetAddress>Lisätie 28 A 5</tiet1:StreetAddress>
                  <tiet1:PostalCode>78310</tiet1:PostalCode>
                  <tiet1:City>Hankojoki</tiet1:City>
                  <tiet1:Country></tiet1:Country>
                  <tiet1:PeriodStart>2012-07-04T00:00:00</tiet1:PeriodStart>
                  <tiet1:PeriodEnd>2050-12-31T00:00:00</tiet1:PeriodEnd>
               </tiet1:Address>
            </tiet1:Addresses>
            <tiet1:Telephones>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>HOME</tiet1:TeleAddressType>
                  <tiet1:AddressValue>071889900</tiet1:AddressValue>
               </tiet1:TeleAddress>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>OFFICE</tiet1:TeleAddressType>
                  <tiet1:AddressValue>020111223</tiet1:AddressValue>
               </tiet1:TeleAddress>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>MOBILE</tiet1:TeleAddressType>
                  <tiet1:AddressValue>04011112222</tiet1:AddressValue>
               </tiet1:TeleAddress>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>OTHER</tiet1:TeleAddressType>
                  <tiet1:AddressValue>987654321</tiet1:AddressValue>
               </tiet1:TeleAddress>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>EMAIL</tiet1:TeleAddressType>
                  <tiet1:AddressValue>jokunimi@gmail.com</tiet1:AddressValue>
               </tiet1:TeleAddress>
               <tiet1:TeleAddress>
                  <tiet1:TeleAddressType>FAX</tiet1:TeleAddressType>
                  <tiet1:AddressValue>ei.oo.com</tiet1:AddressValue>
               </tiet1:TeleAddress>
            </tiet1:Telephones>
            <tiet1:RecidenceCity>
               <tiet1:CodeSetName></tiet1:CodeSetName>
               <tiet1:CodeSetId></tiet1:CodeSetId>
               <tiet1:CodeValue>061</tiet1:CodeValue>
               <tiet1:CodeDescription></tiet1:CodeDescription>
            </tiet1:RecidenceCity>
            <tiet1:BirthCity>
               <tiet1:CodeSetName></tiet1:CodeSetName>
               <tiet1:CodeSetId></tiet1:CodeSetId>
               <tiet1:CodeValue>072</tiet1:CodeValue>
               <tiet1:CodeDescription></tiet1:CodeDescription>
            </tiet1:BirthCity>
            <tiet1:Permissions>
               <tiet1:Permission>
                  <tiet1:PermissionType>SMS</tiet1:PermissionType>
                  <tiet1:Allowed>true</tiet1:Allowed>
               </tiet1:Permission>
            </tiet1:Permissions>
            <tiet1:PreviousFamilyName>Kukkanen</tiet1:PreviousFamilyName>
            <tiet1:DCTConsent>
               <tiet1:ConsentValid>true</tiet1:ConsentValid>
               <tiet1:StartDate>2013-09-30T15:00:00</tiet1:StartDate>
               <tiet1:EndDate>2013-09-30T15:00:00</tiet1:EndDate>
            </tiet1:DCTConsent>
          </urn1:PatientUpd> 
      </urn:UpdatePatientDataRequest>
   </soapenv:Body>
</soapenv:Envelope>